use phf::phf_map;

// 踊り字展開で使われる濁音化マップ
pub(crate) static TO_DAKUON: phf::Map<&'static str, &'static str> = phf_map! {
    "カ" => "ガ", "キ" => "ギ", "ク" => "グ", "ケ" => "ゲ", "コ" => "ゴ",
    "サ" => "ザ", "シ" => "ジ", "ス" => "ズ", "セ" => "ゼ", "ソ" => "ゾ",
    "タ" => "ダ", "チ" => "ヂ", "ツ" => "ヅ", "テ" => "デ", "ト" => "ド",
    "ハ" => "バ", "ヒ" => "ビ", "フ" => "ブ", "ヘ" => "ベ", "ホ" => "ボ",
    "か" => "が", "き" => "ぎ", "く" => "ぐ", "け" => "げ", "こ" => "ご",
    "さ" => "ざ", "し" => "じ", "す" => "ず", "せ" => "ぜ", "そ" => "ぞ",
    "た" => "だ", "ち" => "ぢ", "つ" => "づ", "て" => "で", "と" => "ど",
    "は" => "ば", "ひ" => "び", "ふ" => "ぶ", "へ" => "べ", "ほ" => "ぼ",

    // そもそも一の字点 (ゝ、ゞ) は、本来1文字の仮名に対して使うものであり、拗音に対して使うのは望まれないが、
    // 拗音を含むモーラに逆に濁音化しないような何かしらの定義を与える方が難しい
    "キャ" => "ギャ", "キュ" => "ギュ", "キョ" => "ギョ",
    "シャ" => "ジャ", "シュ" => "ジュ", "ショ" => "ジョ",
    "チャ" => "ヂャ", "チュ" => "ヂュ", "チョ" => "ヂョ",
    "ヒャ" => "ビャ", "ヒュ" => "ビュ", "ヒョ" => "ビョ",
    "きゃ" => "ぎゃ", "きゅ" => "ぎゅ", "きょ" => "ぎょ",
    "しゃ" => "じゃ", "しゅ" => "じゅ", "しょ" => "じょ",
    "ちゃ" => "ぢゃ", "ちゅ" => "ぢゅ", "ちょ" => "ぢょ",
    "ひゃ" => "びゃ", "ひゅ" => "びゅ", "ひょ" => "びょ",
};

/// 踊り字展開で使われる清音化マップ
pub(crate) static TO_SEION: phf::Map<&'static str, &'static str> = phf_map! {
    "ガ" => "カ", "ギ" => "キ", "グ" => "ク", "ゲ" => "ケ", "ゴ" => "コ",
    "ザ" => "サ", "ジ" => "シ", "ズ" => "ス", "ゼ" => "セ", "ゾ" => "ソ",
    "ダ" => "タ", "ヂ" => "チ", "ヅ" => "ツ", "デ" => "テ", "ド" => "ト",
    "バ" => "ハ", "ビ" => "ヒ", "ブ" => "フ", "ベ" => "ヘ", "ボ" => "ホ",
    "が" => "か", "ぎ" => "き", "ぐ" => "く", "げ" => "け", "ご" => "こ",
    "ざ" => "さ", "じ" => "し", "ず" => "す", "ぜ" => "せ", "ぞ" => "そ",
    "だ" => "た", "ぢ" => "ち", "づ" => "つ", "で" => "て", "ど" => "と",
    "ば" => "は", "び" => "ひ", "ぶ" => "ふ", "べ" => "へ", "ぼ" => "ほ",
};

/// 踊り字展開で使われる清音化マップ
pub(crate) static TO_SEION_CHAR: phf::Map<char, char> = phf_map! {
    'ガ' => 'カ', 'ギ' => 'キ', 'グ' => 'ク', 'ゲ' => 'ケ', 'ゴ' => 'コ',
    'ザ' => 'サ', 'ジ' => 'シ', 'ズ' => 'ス', 'ゼ' => 'セ', 'ゾ' => 'ソ',
    'ダ' => 'タ', 'ヂ' => 'チ', 'ヅ' => 'ツ', 'デ' => 'テ', 'ド' => 'ト',
    'バ' => 'ハ', 'ビ' => 'ヒ', 'ブ' => 'フ', 'ベ' => 'ヘ', 'ボ' => 'ホ',
    'が' => 'か', 'ぎ' => 'き', 'ぐ' => 'く', 'げ' => 'け', 'ご' => 'こ',
    'ざ' => 'さ', 'じ' => 'し', 'ず' => 'す', 'ぜ' => 'せ', 'ぞ' => 'そ',
    'だ' => 'た', 'ぢ' => 'ち', 'づ' => 'つ', 'で' => 'て', 'ど' => 'と',
    'ば' => 'は', 'び' => 'ひ', 'ぶ' => 'ふ', 'べ' => 'へ', 'ぼ' => 'ほ',
};
